#range-ке мысал
student_name = input()  #Студенттің есімін енгіземіз
marks = {'Айман': 90, 'Наби': 95, 'Серік': 85}  # {} - marks деген словарь
for student in marks:  # Словарьдың ішінен іздейтін цикл
    if student == student_name: #Егер студенттің есімі словарьда болса
        print(marks[student])  #Бағасын шығару
        break #Программаны тоқтату
else: #Егер енгізілген есім болмаса
    print('Бұл есім табылмады.') #Экранға шығару


#randrange-ке мысал
import random #Библиотеканы импорттап аламыз
number1 = random.randrange(5,100,5)#start - 5,stop - 100,step -5
print("Рандомный сан -  ", number1) #Экранға шығару



#randInt()-ке мысал
import random #Библиотеканы импорттап аламыз
r1 = random.randint(0, 100) #0 мен 100 аралығындағы кез келген санды генерациялайды
print("0 мен 100 аралығындағы рандомный сан -  % s" % (r1)) #Экранға шығарады


#1
a = int(input()) #1-ші бүтін санды енгізу
b = int(input()) #2-ші бүтін санды енгізу
if a <= b : #Егер а b-дан кіші болса
   for i in range(a, b+1):# a-дан b-ға дейінгі сандарды өсу реті бойынша шығаруға range функц қолданамыз
      print(i) #Экранға шығару


#2
a = int(input()) #1-ші бүтін санды енгізу
b = int(input()) #2-ші бүтін санды енгізу
if a < b: #Егер а b-дан кіші болса
    for i in range(a, b + 1):#a-дан b-ға дейінгі сандарды өсу реті бойынша шығаруға range функц қолданамыз
        print(i)
else:  # Егер шарт орындалмаса
    for i in range(a, b - 1, -1): #a-дан b-ға дейінгі сандарды кему реті бойынша шығаруға range функц қолданамыз
        print(i)


#3
a = int(input()) #1-ші бүтін санды енгізу 20
b = int(input()) #2-ші бүтін санды енгізу  8
for i in range(a - (a + 1) % 2, b - b % 2, -2): #start - 20 - 21 % 2 (19) , stop - 8 - 8 % 2 (8), step - 2
    print(i) #19 17 15 13 11  9


#4
n = int(input()) #N-ге дейінгі сандары бар карталар 15
sum = 0
for i in range(1, n + 1): #1-ден 16-ға дейінгі
    sum += i  #sum = sum + i
for i in range(n - 1):  #15
    sum -= int(input()) #sum = sum - int(input())
print(sum) #Сумманы шығару

